Repository: common-repository/subscribe-google-groups
Catalog: languages/*.po
Languages: fi

source: Success. You should receive confirmation message in 10 minutes. If not, please subscribe manually.
fi: Onnistui. Sinun pitäisi saada vahvistusviesti 10 minuutin sisällä. Ellei viestiä tule, liity ryhmään manuaalisesti.

source: Error. Subscribing to group failed. Please, subscribe manually.
fi: Virhe. Ryhmään liittyminen epäonnistui. Ole hyvä, ja liity manuaalisesti.

source: Widget for subscribing to Google Groups.
fi: Vimpain, jonka avulla voi liittyä Google-ryhmiin

source: Title:
fi: Otsikko:

source: Group Name:
fi: Ryhmän nimi:

source: Please, enter group name in widget settings.
fi: Ole hyvä, ja aseta ryhmän nimi vimpaimen asetuksissa.

source: E-mail:
fi: Sähköpostiosoite:

source: Subscribe
fi: Liity

source: Google Groups Subscribe
fi: Google -ryhmiin liittyminen

source: Adds widget for subscribing to Google Groups
fi: Vimpain, jonka avulla voi liittyä Google-ryhmiin
